# Indian Census 2011 Analysis Using SQL

# Objective

To perform comprehensive analysis of Indian census data using SQL to gain insights into demographic trends, population distribution, and socioeconomic indicators. The aim is to leverage SQL querying and data manipulation techniques to extract meaningful information, identify patterns, and generate actionable recommendations to support evidence-based decision-making in various domains, such as  public policy, and resource allocation.

## 01. Importing sql and pandas

In [59]:
import pandas as pd
import sqlite3

In [60]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\raju kumar gond\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython-sql) (2.0.16)
Requirement already satisfied: ipython in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: ipython-genutils in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: prettytable in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython-sql) (3.8.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.6.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pickleshare in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: colorama in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: backcall in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pygments>=2.4.0 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (61.2.0)
Requirement already satisfied: decorator in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: stack-data in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\raju kumar gond\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\raju kumar gond\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: executing in c:\users\raju kumar gond\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\users\raju kumar gond\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in c:\users\raju kumar gond\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)

## 02.Loading dataset using pandas

In [63]:
df_1=pd.read_excel('Dataset1.xlsx')
df_2=pd.read_excel('Dataset2.xlsx')

In [57]:
df_1.head()

                     District        State  Growth  Sex_Ratio  Literacy
0                       Thane  Maharashtra  0.3601        886     84.53
1  North Twenty Four Parganas  West Bengal  0.1204        955     84.06
2                   Bangalore    Karnataka  0.4718        916     87.67
3                        Pune  Maharashtra  0.3037        915     86.15
4             Mumbai Suburban  Maharashtra  0.0829        860     89.91

In [58]:
df_2.head()

     District           State  Area_km2  Population
0    Adilabad  Andhra Pradesh     16105     2741239
1        Agra   Uttar Pradesh      4041     4418797
2   Ahmadabad         Gujarat      8107     7214225
3  Ahmadnagar     Maharashtra     17048     4543159
4      Aizawl         Mizoram      3576      400309

## 03.Creating a connection to the database

In [64]:
connection=sqlite3.connect('jupyter_sql_tutorial.db')

## 04.Naming the database and holding the connections

In [38]:
df_1.to_sql('Dataset__1',connection)

640

In [39]:
df_2.to_sql('Dataset__2',connection)

640

## 05.Loading sql module to iPython

In [61]:
%reload_ext sql

In [62]:
%sql sqlite:///jupyter_sql_tutorial.db

## 06. Dataset - cheking how actually dataset looks like

In [65]:
 %%sql
select * from Dataset__1 limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Thane', 'Maharashtra', 0.3601, 886, 84.53),
 (1, 'North Twenty Four Parganas', 'West Bengal', 0.1204, 955, 84.06),
 (2, 'Bangalore', 'Karnataka', 0.4718, 916, 87.67),
 (3, 'Pune', 'Maharashtra', 0.3037, 915, 86.15),
 (4, 'Mumbai Suburban', 'Maharashtra', 0.0829, 860, 89.91),
 (5, 'South Twenty Four Parganas', 'West Bengal', 0.1817, 956, 77.51),
 (6, 'Barddhaman', 'West Bengal', 0.1192, 945, 76.21),
 (7, 'Ahmadabad', 'Gujarat', 0.2403, 904, 85.31),
 (8, 'Murshidabad', 'West Bengal', 0.2109, 958, 66.59),
 (9, 'Jaipur', 'Rajasthan', 0.2619, 910, 75.51)]

In [66]:
%%sql
select * from Dataset__2 limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Adilabad', 'Andhra Pradesh', 16105, 2741239),
 (1, 'Agra', 'Uttar Pradesh', 4041, 4418797),
 (2, 'Ahmadabad', 'Gujarat', 8107, 7214225),
 (3, 'Ahmadnagar', 'Maharashtra', 17048, 4543159),
 (4, 'Aizawl', 'Mizoram', 3576, 400309),
 (5, 'Ajmer', 'Rajasthan', 8481, 2583052),
 (6, 'Akola', 'Maharashtra', 5676, 1813906),
 (7, 'Alappuzha', 'Kerala', 1415, 2127789),
 (8, 'Aligarh', 'Uttar Pradesh', 3650, 3673889),
 (9, 'Alirajpur', 'Madhya Pradesh', 3182, 728999)]

## 07. Checking the number of rows in dataset- Aggregate function "SUM".

In [42]:
%%sql
select count(*)as total_rows from Dataset__1

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(640,)]

In [43]:
%%sql
select count(*)as total_rows from Dataset__2

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(640,)]

## 08. Checking  Dataset for state bihar and jharkhand.

In [69]:
%%sql
select * from Dataset__1 where State in ('Bihar' , 'Jharkhand') limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(14, 'Patna', 'Bihar', 0.2373, 897, 70.68),
 (19, 'Purbi Champaran', 'Bihar', 0.2943, 902, 55.79),
 (23, 'Muzaffarpur', 'Bihar', 0.2814, 900, 63.43),
 (36, 'Madhubani', 'Bihar', 0.2551, 926, 58.62),
 (41, 'Gaya', 'Bihar', 0.2643, 937, 63.67),
 (44, 'Samastipur', 'Bihar', 0.2553, 911, 61.86),
 (58, 'Saran', 'Bihar', 0.2164, 954, 65.96),
 (60, 'Darbhanga', 'Bihar', 0.1947, 911, 56.56),
 (63, 'Pashchim Champaran', 'Bihar', 0.2929, 909, 55.7),
 (86, 'Vaishali', 'Bihar', 0.2857, 895, 66.6)]

## 09. Checking Population of India- Uses of Aggregate function "SUM"

In [45]:
%%sql
select sum(Population) as Population from Dataset__2

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1210854977,)]

##  10. Checking average growth of india- Uses of Aggregate function "AVG"

In [46]:
%%sql
select avg(growth)*100 as Average_growth from Dataset__1

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(19.24592187500001,)]

## 11.Checking  Average growth of different states

In [74]:
%%sql
select  State  , avg(growth)*100 as Average_growth from Dataset__1 group by State order by Average_growth desc limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Nagaland', 82.28090909090909),
 ('Dadra and Nagar Haveli', 55.879999999999995),
 ('Daman and Diu', 42.74),
 ('Puducherry', 34.2975),
 ('Meghalaya', 30.39428571428572),
 ('Arunachal Pradesh', 27.805624999999996),
 ('Manipur', 25.54111111111111),
 ('Bihar', 25.23184210526316),
 ('Mizoram', 24.346249999999998),
 ('Jammu and Kashmir', 24.270454545454545)]

## 12.Checking Average sex ratio of different states

In [73]:
%%sql
select State , round(avg(Sex_Ratio),0) as avg_sex_ratio from Dataset__1 group by 
State  order by avg_sex_ratio desc limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Kerala', 1080.0),
 ('Puducherry', 1075.0),
 ('Uttarakhand', 1010.0),
 ('Tamil Nadu', 999.0),
 ('Chhattisgarh', 995.0),
 ('Andhra Pradesh', 995.0),
 ('Orissa', 984.0),
 ('Karnataka', 984.0),
 ('Meghalaya', 980.0),
 ('Manipur', 976.0)]

## 13. Finding list of the  states which average Literacy ratio is geater than 90- uses of "GROUP BY " and  "HAVING" Clause"

In [49]:
%%sql

select State , round(avg(Literacy),0) as avg_literacy_ratio from Dataset__1 group by 
State  having  avg_literacy_ratio >90 order by avg_literacy_ratio desc

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Kerala', 94.0), ('Lakshadweep', 92.0)]

## 14. List of top three states with highest growth- uses of "LIMIT"  Clause.

In [50]:
%%sql
select   State  , avg(growth)*100 as Average_growth from Dataset__1 group by 
State  order by Average_growth desc limit 3

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Nagaland', 82.28090909090909),
 ('Dadra and Nagar Haveli', 55.879999999999995),
 ('Daman and Diu', 42.74)]

## 15. List of the states which starting with 'a' and ending with 'm'- uses of "LIKE" operator.

In [51]:
%%sql

select distinct State from Dataset__1 where lower(state) like 'a%' and lower (state) 
like '%m'

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Assam',)]

## 16. Joining both table - "INNER JOIN"

In [67]:
%%sql
select a.District , a.State , a.Sex_Ratio , b.Population from Dataset__1 as a inner 
join Dataset_2 as b on a.District = b.District limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Thane', 'Maharashtra', 886, 11060148),
 ('North Twenty Four Parganas', 'West Bengal', 955, 10009781),
 ('Bangalore', 'Karnataka', 916, 9621551),
 ('Pune', 'Maharashtra', 915, 9429408),
 ('Mumbai Suburban', 'Maharashtra', 860, 9356962),
 ('South Twenty Four Parganas', 'West Bengal', 956, 8161961),
 ('Barddhaman', 'West Bengal', 945, 7717563),
 ('Ahmadabad', 'Gujarat', 904, 7214225),
 ('Murshidabad', 'West Bengal', 958, 7103807),
 ('Jaipur', 'Rajasthan', 910, 6626178)]

## 17. Finding number of Males and Females in different states- uses of 'Subquery' and 'Alias'.

In [72]:
%%sql

select d.state , sum(d.males)as total_males, sum(d.females) as total_females from

(select c.district , c.state , round((c.population)/(c.sex_ratio+1),0) as males , 
round((c.population*c.sex_ratio)/(c.sex_ratio+1) ,0) as females from
 
(select a.District , a.State , a.Sex_Ratio/1000 as sex_ratio, b.Population from 
Dataset_1 as a inner join Dataset__2 as b on a.District = b.District) as c)

as d

group by d.state limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Andaman And Nicobar Islands', 274984.0, 0.0),
 ('Andhra Pradesh', 66989042.0, 17591730.0),
 ('Arunachal Pradesh', 1121771.0, 85383.0),
 ('Assam', 31205576.0, 0.0),
 ('Bihar', 101420357.0, 1281006.0),
 ('Chandigarh', 1055450.0, 0.0),
 ('Chhattisgarh', 24360212.0, 2817266.0),
 ('Daman and Diu', 217210.0, 26037.0),
 ('Delhi', 142004.0, 0.0),
 ('Goa', 1458545.0, 0.0)]

## 18. Checking Total literacy ratio of different states

In [71]:
%%sql

select c.state,sum(c.literate_people) as total_literate_people,sum
(c.illiterate_people) as total_illiterate_people from

(select d.district,d.state,round( d.literacy_ratio*d.population,0) as 
literate_people,round((1-d.literacy_ratio)*d.population,0) as illiterate_people 
from 
 
(select a.district,a.state,a.literacy/100 as literacy_ratio ,b.population from 
Dataset_1 as a inner join Dataset__2 as b on a.District=b.District ) as d)

as c

group by c.state limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Andaman And Nicobar Islands', 241015.0, 33969.0),
 ('Andhra Pradesh', 56671677.0, 27909100.0),
 ('Arunachal Pradesh', 761557.0, 445597.0),
 ('Assam', 22484409.0, 8721167.0),
 ('Bihar', 63994271.0, 38707092.0),
 ('Chandigarh', 908215.0, 147235.0),
 ('Chhattisgarh', 18621154.0, 8556328.0),
 ('Daman and Diu', 211827.0, 31420.0),
 ('Delhi', 125446.0, 16558.0),
 ('Goa', 1293736.0, 164809.0)]

## 19. Cheking the Population in previous Census.

In [70]:
%%sql

select d.state,sum(d.prev_populatoin) as prev_census_population , sum
(d.curr_population) as curr_census_population from

(select c.district ,c.state, round(( c.population- c.growth*c.population ),0) as 
prev_populatoin , c.growth, c.population as curr_population from 
 
(select a.district,a.state,a.Growth as Growth ,b.population from Dataset_1 as a inner 
join Dataset__2 as b on a.District=b.District)as c) 

as d 

group by d.state limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Andaman And Nicobar Islands', 245672.0, 274984),
 ('Andhra Pradesh', 74686197.0, 84580777),
 ('Arunachal Pradesh', 866114.0, 1207154),
 ('Assam', 25807225.0, 31205576),
 ('Bihar', 76674920.0, 102701363),
 ('Chandigarh', 874018.0, 1055450),
 ('Chhattisgarh', 21107276.0, 27177482),
 ('Daman and Diu', 104550.0, 243247),
 ('Delhi', 171427.0, 142004),
 ('Goa', 1338494.0, 1458545)]

##  20. List of top three district of every states with highest literacy rate - uses of "RANK" function.

In [68]:
%%sql
select a.* from
(select district,state, literacy ,rank() over(partition by state order by literacy 
desc ) as rnk from Dataset__1) as a
where a.rnk in(1,2,3) limit 10

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('South Andaman', 'Andaman And Nicobar Islands', 89.13, 1),
 ('North And Middle Andaman', 'Andaman And Nicobar Islands', 83.91, 2),
 ('Nicobars', 'Andaman And Nicobar Islands', 78.06, 3),
 ('Hyderabad', 'Andhra Pradesh', 83.25, 1),
 ('Rangareddy', 'Andhra Pradesh', 75.87, 2),
 ('West Godavari', 'Andhra Pradesh', 74.63, 3),
 ('Papumpare', 'Arunachal Pradesh', 79.95, 1),
 ('Lower Subansiri', 'Arunachal Pradesh', 74.35, 2),
 ('East Siang', 'Arunachal Pradesh', 72.54, 3),
 ('Kamrup Metropolitan', 'Assam', 88.71, 1)]

# Conclusion:

The analysis of Indian census data using SQL has provided valuable insights into the demographic landscape and socioeconomic indicators of the country. By leveraging powerful querying and data manipulation techniques, I was able to extract meaningful information and identify important patterns and trends.

Key findings from the analysis include:

Population Distribution: The analysis revealed the distribution of population across different states and district. It highlighted the regions  with higher population densities. This information can aid in  resource allocation, and infrastructure development.

Socioeconomic Indicators: By analyzing variables such as literacy rates and growth rateswe gained an understanding of the social and economic conditions prevailing in different regions. This knowledge can inform policies and initiatives aimed at promoting inclusive growth, reducing inequality, and improving living standards.

Demographic Trends: The analysis uncovered demographic trends such as population growth rates and gender ratios. These insights help in identifying potential challenges and opportunities related to healthcare, education, and social welfare programs.



In conclusion, the analysis of Indian census data using SQL has provided a comprehensive view of the country's demographics and socioeconomic landscape. The insights gained from this analysis can inform evidence-based decision-making, policy formulation, and resource allocation, with the ultimate goal of fostering sustainable and inclusive development across India.